---
title: AlphanumericRevisionSettings
classe: Autodesk.Revit.DB.AlphanumericRevisionSettings
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 8
---

# AlphanumericRevisionSettings

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `alphanumericRevisionSettings.IsValidObject` | Boolean |
| `String Prefix { get; set; }` | `alphanumericRevisionSettings.Prefix` | String |
| `String Suffix { get; set; }` | `alphanumericRevisionSettings.Suffix` | String |
| `Void Dispose()` | `alphanumericRevisionSettings.Dispose()` | Void |
| `IList<String> GetSequence()` | `alphanumericRevisionSettings.GetSequence()` | IList<String> |
| `Boolean IsEqual(AlphanumericRevisionSettings)` | `alphanumericRevisionSettings.IsEqual(other)` | Boolean |
| `Boolean IsValid()` | `alphanumericRevisionSettings.IsValid()` | Boolean |
| `Void SetSequence(IList<String>)` | `alphanumericRevisionSettings.SetSequence(sequence)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```